OdBrepBuilder.setTag(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the tag value that is used for faces and edges. MODE: kSetTagMode.
Use setTag() just after addEdge() and addFace() calls.
\param id  [in] B-Rep builder entity ID.
\param tag [in] Tag value.
\remarks
kSetTagMode and kAutoMode are incompatible. You cannot use methods setTag()
and setInitialTag() at the same time.

OdBrepBuilder.setInitialTag(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the initial tag value that is used for faces and edges.
\param indTag [in] Tag ID.

OdBrepBuilder.finish
\details
Completes construction of the geometry. The geometry is validated and, if
valid, stored in this Builder.
\returns Pointer to the built entity, that is specific for each
product-dependent implementation.

OdBrepBuilder.setFacesMaterial(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDbStub*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the material ID to the specified face.
\param faceId     [in] Face ID.
\param materialId [in] Material ID.